{
  "_name_or_path": "/Users/chenweihao/Desktop/\u8bba\u6587/classification/microsoft:resnet-50",
  "architectures": [
    "ResNetModel"
  ],
  "depths": [
    3,
    4,
    6,
    3
  ],
  "downsample_in_bottleneck": false,
  "downsample_in_first_stage": false,
  "embedding_size": 64,
  "finetuning_task": "image-classification",
  "hidden_act": "relu",
  "hidden_sizes": [
    256,
    512,
    1024,
    2048
  ],
  "id2label": {
    "0": "A healthy tomato leaf",
    "1": "A tomato leaf with Leaf Mold",
    "2": "A tomato leaf with Target Spot",
    "3": "A tomato leaf with Late Blight",
    "4": "A tomato leaf with Early Blight",
    "5": "A tomato leaf with Bacterial Spot",
    "6": "A tomato leaf with Septoria Leaf Spot",
    "7": "A tomato leaf with Tomato Mosaic Virus",
    "8": "A tomato leaf with Tomato Yellow Leaf Curl Virus",
    "9": "A tomato leaf with Spider Mites Two-spotted Spider Mite"
  },
  "label2id": {
    "A healthy tomato leaf": "0",
    "A tomato leaf with Bacterial Spot": "5",
    "A tomato leaf with Early Blight": "4",
    "A tomato leaf with Late Blight": "3",
    "A tomato leaf with Leaf Mold": "1",
    "A tomato leaf with Septoria Leaf Spot": "6",
    "A tomato leaf with Spider Mites Two-spotted Spider Mite": "9",
    "A tomato leaf with Target Spot": "2",
    "A tomato leaf with Tomato Mosaic Virus": "7",
    "A tomato leaf with Tomato Yellow Leaf Curl Virus": "8"
  },
  "layer_type": "bottleneck",
  "model_type": "resnet",
  "num_channels": 3,
  "out_features": [
    "stage4"
  ],
  "out_indices": [
    4
  ],
  "problem_type": "single_label_classification",
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4"
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.47.1"
}
